<html>
<body>
<h1><a name="manuel"></a>Le Fort DeViNT</h1>
<h2>Auteurs</h2>
Steven Baldet<br>
Alicia Hubert-Vadenay<br>
Guillaume Husson<br>
SI 1, projet DeViNT 2006<br>
<h2>But du jeu</h2>
<p>Il s'agit de d&eacute;couvrir un mot myst&eacute;rieux. Pour y arriver il faut r&eacute;cup&eacute;rer des indices dans les six salles du jeu en r&eacute;pondant correctement &agrave; une question. Chaque salle a un th&egrave;me diff&eacute;rent, ce sont :</p>
<ul>
  <li>la salle d’entr&eacute;e, o&ugrave; vous devrez taper le mot myst&egrave;re,</li>
  <li>la salle de bruits, o&ugrave; il faut reconnaitre un bruit,</li>
  <li>la salle de culture musicale : dans cette salle il faudra r&eacute;pondre &agrave; une question sur la musique en g&eacute;n&eacute;ral, </li>
  <li>la salle de culture g&eacute;n&eacute;rale : o&ugrave; il faudra r&eacute;pondre &agrave; une question d’histoire, de math&eacute;matiques, de g&eacute;ographie, de sport, ou de litt&eacute;rature</li>
  <li>la salle des rythmes, dans cette salle, il faut reconnaitre un rythme</li>
  <li>la salle des instruments, o&ugrave;  il faut reconnaitre un instrument de musique</li>
  <li>la salle des m&eacute;lodies, o&ugrave; il faut reconnaitre une m&eacute;lodie.</li>
</ul>
<p>Ce jeu n’est pas un labyrinthe, et &agrave; aucun moment vous ne serez perdu. Les salles forment un cercle, et il suffit de se d&eacute;placer dans une m&ecirc;me direction pour parcourir successivement toutes les salles.</p>
<h2>R&eacute;gles du jeu</h2>
<p>Tout au long de la partie, vous serez guid&eacute; par LA voix.<br>
  LA voix peut &ecirc;tre interrompue, par une action sur le clavier ou la souris, sauf pendant qu'elle pose une question, veuillez donc attendre qu’elle a&icirc;t fini pour lui indiquer votre choix en tapant sur la touche correspondante.<br>
  Au d&eacute;but de la partie vous avez le choix entre quatre options :</p>
<ul>
  <li>Nouvelle Partie : tapez F1 pour commencer une nouvelle partie</li>
  <li>Charger derni&egrave;re partie : tapez  F2 pour recommencer la derni&egrave;re partie l&agrave; où vous vous &eacute;tiez arr&ecirc;t&eacute; avec le m&ecirc;me mot myst&egrave;re, et les m&ecirc;mes indices d&eacute;j&agrave; trouv&eacute;s (au cours du jeu, il n’est pas n&eacute;cessaire de sauvegarder, le jeu le fait tout seul)<br>
  </li>
  <li>But du jeu (tapez F3), et LA voix vous explique les r&egrave;gles du jeu.</li>
  <li>R&eacute;&eacute;couter le message d'introduction (tapez F4)<br>
  </li>
</ul>
<p><br>
  A chaque nouvelle partie, vous devez taper votre nom puis taper « Entr&eacute;e » et choisir un niveau de difficult&eacute; :</p>
<ul>
  <li> pour facile, taper F1</li>
  <li>moyen (taper F2)</li>
  <li>difficile (taper F3)</li>
  <li>pour  r&eacute;p&eacute;ter (taper F4)</li>
  <li>pour revenir au menu d'accueil (taper F5)</li>
</ul>
<p>Vous vous trouverez alors dans la salle d’entr&eacute;e du jeu Fort DeViNT.</p>
<p>Quand vous reprenez une partie, vous vous trouvez dans la derni&egrave;re salle où vous &eacute;tiez avant de quitter la partie.</p>
<p>En g&eacute;n&eacute;ral quand vous &ecirc;tes dans une salle :</p>
<ul>
  <li>Tapez F1 pour l’aide</li>
  <li>Tapez F2 pour connaitre les indices que vous avez.</li>
  <li>Tapez « Entr&eacute;e » pour tenter l’&eacute;preuve</li>
  <li>Utilisez les fl&egrave;ches directionnelles droite et gauche du clavier pour vous d&eacute;placer, les salles sont dispos&eacute;es en cercle.</li>
</ul>
<p>ATTENTION, vous ne pouvez entendre la question qu’une seule fois, pour r&eacute;p&eacute;ter, il faut entrer &agrave; nouveau dans la salle, et pour r&eacute;pondre :</p>
<ul>
  <li> Taper F1  pour la r&eacute;ponse 1</li>
  <li>Taper F2 pour la r&eacute;ponse 2</li>
  <li>Taper F3  pour la r&eacute;ponse 3</li>
</ul>
<p>Pour terminer le jeu, on utilise la touche &eacute;chap du clavier. </p>
<h2>Public concern&eacute;</h2>
Ce jeu s’adresse &agrave; des enfants ayant entre 8 et 16 ans.<br>
<h2>Conditions particuli&egrave;res</h2>
<p>impossible d'interrompre la voix quand elle pose une question </p>
<p><br>
  </div>
</p>
</body>
</html>